SpenceKonde/ATTinyCore/avr/boards.txt
# Overhauled summer 2015 by Dr. Azzy (Spence Konde) and again in early 2016 to add support for more chips.

menu.chip=Chip
menu.clk=Clock
menu.bod=B.O.D. Level
menu.bodact=B.O.D. Mode (active)
menu.bodpd=B.O.D. Mode (sleep)
menu.eesave=Save EEPROM
menu.vcc=Voltage
menu.pinmap=Pin Mapping
menu.INITIALIZE_SECONDARY_TIMERS=Initialize Secondary Timers
menu.T1CS=Timer 1 Clock
menu.LTO=LTO (1.6.11+ only)
menu.bootUART=Bootloader UART
menu.wiremode=Wire Modes





attinyx4.name=ATtiny24/44/84
attinyx4.upload.maximum_size=8192
attinyx4.upload.maximum_data_size=512
attinyx4.upload.tool=avrdude
attinyx4.build.board=AVR_ATTINYX4
attinyx4.bootloader.tool=avrdude
attinyx4.bootloader.unlock_bits=0xFF
attinyx4.bootloader.lock_bits=0xFF
attinyx4.bootloader.file=empty/empty_all.hex
attinyx4.menu.LTO.no=Disabled
attinyx4.menu.LTO.no.ltocflags=
attinyx4.menu.LTO.no.ltoelfflags=
attinyx4.menu.LTO.no.ltocppflags=
attinyx4.menu.LTO.no.ltoarcmd=
attinyx4.menu.LTO.yes=Enabled
attinyx4.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx4.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx4.menu.LTO.yes.ltocppflags=-flto
attinyx4.menu.LTO.yes.ltoarcmd=gcc-
attinyx4.menu.chip.84=ATtiny84
attinyx4.menu.chip.84.build.mcu=attiny84
attinyx4.menu.chip.84.upload.maximum_size=8192
attinyx4.menu.chip.84.upload.maximum_data_size=512
attinyx4.menu.chip.44=ATtiny44
attinyx4.menu.chip.44.build.mcu=attiny44
attinyx4.menu.chip.44.upload.maximum_size=4096
attinyx4.menu.chip.44.upload.maximum_data_size=256
attinyx4.menu.chip.24=ATtiny24
attinyx4.menu.chip.24.build.mcu=attiny24
attinyx4.menu.chip.24.upload.maximum_size=2048
attinyx4.menu.chip.24.upload.maximum_data_size=128
attinyx4.build.core=tiny
attinyx4.build.export_merged_output=false
attinyx4.bootloader.extended_fuses=0xFF
attinyx4.menu.clk.8int=8 MHz (internal)
attinyx4.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx4.menu.clk.8int.build.f_cpu=8000000L
attinyx4.menu.clk.20ext=20 MHz (external)
attinyx4.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.20ext.build.f_cpu=20000000L
attinyx4.menu.clk.16ext=16 MHz (external)
attinyx4.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.16ext.build.f_cpu=16000000L
attinyx4.menu.clk.12ext=12 MHz (external)
attinyx4.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.12ext.build.f_cpu=12000000L
attinyx4.menu.clk.8ext=8 MHz (external)
attinyx4.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.8ext.build.f_cpu=8000000L
attinyx4.menu.clk.6ext=6 MHz (external)
attinyx4.menu.clk.6ext.bootloader.low_fuses=0xFD
attinyx4.menu.clk.6ext.build.f_cpu=6000000L
attinyx4.menu.clk.4ext=4 MHz (external)
attinyx4.menu.clk.4ext.bootloader.low_fuses=0xFD
attinyx4.menu.clk.4ext.build.f_cpu=4000000L
attinyx4.menu.clk.1int=1 MHz (internal)
attinyx4.menu.clk.1int.bootloader.low_fuses=0x62
attinyx4.menu.clk.1int.build.f_cpu=1000000L
attinyx4.menu.clk.737ext=7.372 MHz (external)
attinyx4.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx4.menu.clk.737ext.build.f_cpu=7372800L
attinyx4.menu.clk.92ext=9.216 MHz (external)
attinyx4.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.92ext.build.f_cpu=9216000L
attinyx4.menu.clk.11ext=11.0592 MHz (external)
attinyx4.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.11ext.build.f_cpu=11059200L
attinyx4.menu.clk.14ext=14.7456 MHz (external)
attinyx4.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.14ext.build.f_cpu=14745600L
attinyx4.menu.clk.184ext=18.432 MHz (external)
attinyx4.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx4.menu.clk.184ext.build.f_cpu=18432000L
attinyx4.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx4.menu.ee.ayes=EEPROM retained
attinyx4.menu.ee.ayes.bootloader.eesave_bit=0
attinyx4.menu.ee.no=EEPROM not retained
attinyx4.menu.ee.no.bootloader.eesave_bit=1
attinyx4.menu.bod.disable=B.O.D. Disabled
attinyx4.menu.bod.disable.bootloader.bod_bits=111
attinyx4.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4.menu.bod.1v8.bootloader.bod_bits=110
attinyx4.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4.menu.bod.2v7.bootloader.bod_bits=101
attinyx4.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4.menu.bod.4v3.bootloader.bod_bits=100
attinyx4.menu.pinmap.anew=Clockwise (like damellis core)
attinyx4.menu.pinmap.anew.build.variant=tinyX4_reverse
attinyx4.menu.pinmap.old=Counterclockwise (like old ATTinyCore and x41-series)
attinyx4.menu.pinmap.old.build.variant=tinyX4

attinyx4opti.name=ATtiny44/84 (optiboot)
attinyx4opti.upload.tool=avrdude
attinyx4opti.upload.protocol=arduino
attinyx4opti.upload.speed=19200
attinyx4opti.build.board=AVR_ATTINYX4
attinyx4opti.bootloader.tool=avrdude
attinyx4opti.bootloader.unlock_bits=0xFF
attinyx4opti.bootloader.lock_bits=0xFF
attinyx4opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx4opti.menu.LTO.no=Disabled
attinyx4opti.menu.LTO.no.ltocflags=
attinyx4opti.menu.LTO.no.ltoelfflags=
attinyx4opti.menu.LTO.no.ltocppflags=
attinyx4opti.menu.LTO.no.ltoarcmd=
attinyx4opti.menu.LTO.yes=Enabled
attinyx4opti.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx4opti.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx4opti.menu.LTO.yes.ltocppflags=-flto
attinyx4opti.menu.LTO.yes.ltoarcmd=gcc-
attinyx4opti.menu.chip.84=ATtiny84
attinyx4opti.menu.chip.84.build.mcu=attiny84
attinyx4opti.menu.chip.84.upload.maximum_size=7552
attinyx4opti.menu.chip.84.upload.maximum_data_size=512
attinyx4opti.menu.chip.44=ATtiny44
attinyx4opti.menu.chip.44.build.mcu=attiny44
attinyx4opti.menu.chip.44.upload.maximum_size=3456
attinyx4opti.menu.chip.44.upload.maximum_data_size=256
attinyx4opti.build.core=tiny
attinyx4opti.build.export_merged_output=false
attinyx4opti.bootloader.extended_fuses=0xFE
attinyx4opti.menu.clk.8int=8 MHz (internal)
attinyx4opti.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx4opti.menu.clk.8int.build.f_cpu=8000000L
attinyx4opti.menu.clk.20ext=20 MHz (external)
attinyx4opti.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.20ext.build.f_cpu=20000000L
attinyx4opti.menu.clk.16ext=16 MHz (external)
attinyx4opti.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.16ext.build.f_cpu=16000000L
attinyx4opti.menu.clk.12ext=12 MHz (external)
attinyx4opti.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.12ext.build.f_cpu=12000000L
attinyx4opti.menu.clk.8ext=8 MHz (external)
attinyx4opti.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.8ext.build.f_cpu=8000000L
attinyx4opti.menu.clk.737ext=7.372 MHz (external)
attinyx4opti.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx4opti.menu.clk.737ext.build.f_cpu=7372800L
attinyx4opti.menu.clk.92ext=9.216 MHz (external)
attinyx4opti.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.92ext.build.f_cpu=9216000L
attinyx4opti.menu.clk.11ext=11.0592 MHz (external)
attinyx4opti.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.11ext.build.f_cpu=11059200L
attinyx4opti.menu.clk.14ext=14.7456 MHz (external)
attinyx4opti.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.14ext.build.f_cpu=14745600L
attinyx4opti.menu.clk.184ext=18.432 MHz (external)
attinyx4opti.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx4opti.menu.clk.184ext.build.f_cpu=18432000L
attinyx4opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx4opti.menu.ee.ayes=EEPROM retained
attinyx4opti.menu.ee.ayes.bootloader.eesave_bit=0
attinyx4opti.menu.ee.no=EEPROM not retained
attinyx4opti.menu.ee.no.bootloader.eesave_bit=1
attinyx4opti.menu.bod.disable=B.O.D. Disabled
attinyx4opti.menu.bod.disable.bootloader.bod_bits=111
attinyx4opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx4opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx4opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx4opti.menu.pinmap.anew=Clockwise (like damellis core)
attinyx4opti.menu.pinmap.anew.build.variant=tinyX4_reverse
attinyx4opti.menu.pinmap.old=Counterclockwise (like old ATTinyCore and x41-series)
attinyx4opti.menu.pinmap.old.build.variant=tinyX4


attinyx5.name=ATtiny25/45/85
attinyx5.upload.maximum_size=8192
attinyx5.upload.maximum_data_size=512
attinyx5.upload.tool=avrdude
attinyx5.bootloader.tool=avrdude
attinyx5.bootloader.unlock_bits=0xFF
attinyx5.bootloader.lock_bits=0xFF
attinyx5.bootloader.file=empty/empty_all.hex
attinyx5.build.core=tiny
attinyx5.build.board=AVR_ATTINYX5
attinyx5.build.export_merged_output=false
attinyx5.bootloader.extended_fuses=0xFF
attinyx5.menu.LTO.no=Disabled
attinyx5.menu.LTO.no.ltocflags=
attinyx5.menu.LTO.no.ltoelfflags=
attinyx5.menu.LTO.no.ltocppflags=
attinyx5.menu.LTO.no.ltoarcmd=
attinyx5.menu.LTO.yes=Enabled
attinyx5.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx5.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx5.menu.LTO.yes.ltocppflags=-flto
attinyx5.menu.LTO.yes.ltoarcmd=gcc-
attinyx5.menu.T1CS.default=CPU
attinyx5.menu.T1CS.pll=64MHz
attinyx5.menu.T1CS.pll.build.extra_flags=-DPLLTIMER1
attinyx5.menu.T1CS.lowpll=32MHz
attinyx5.menu.T1CS.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx5.menu.chip.85=ATtiny85
attinyx5.menu.chip.85.build.mcu=attiny85
attinyx5.menu.chip.85.upload.maximum_size=8192
attinyx5.menu.chip.85.upload.maximum_data_size=512
attinyx5.menu.chip.45=ATtiny45
attinyx5.menu.chip.45.build.mcu=attiny45
attinyx5.menu.chip.45.upload.maximum_size=4096
attinyx5.menu.chip.45.upload.maximum_data_size=256
attinyx5.menu.chip.25=ATtiny25
attinyx5.menu.chip.25.build.mcu=attiny25
attinyx5.menu.chip.25.upload.maximum_size=2048
attinyx5.menu.chip.25.upload.maximum_data_size=128
attinyx5.menu.clk.8int=8 MHz (internal)
attinyx5.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx5.menu.clk.8int.build.f_cpu=8000000L
attinyx5.menu.clk.16pll=16 MHz (PLL)
attinyx5.menu.clk.16pll.bootloader.low_fuses=0xF1
attinyx5.menu.clk.16pll.build.f_cpu=16000000L
attinyx5.menu.clk.20ext=20 MHz (external)
attinyx5.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.20ext.build.f_cpu=20000000L
attinyx5.menu.clk.16ext=16 MHz (external)
attinyx5.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.16ext.build.f_cpu=16000000L
attinyx5.menu.clk.12ext=12 MHz (external)
attinyx5.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.12ext.build.f_cpu=12000000L
attinyx5.menu.clk.8ext=8 MHz (external)
attinyx5.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.8ext.build.f_cpu=8000000L
attinyx5.menu.clk.6ext=6 MHz (external)
attinyx5.menu.clk.6ext.bootloader.low_fuses=0xFD
attinyx5.menu.clk.6ext.build.f_cpu=6000000L
attinyx5.menu.clk.4ext=4 MHz (external)
attinyx5.menu.clk.4ext.bootloader.low_fuses=0xFD
attinyx5.menu.clk.4ext.build.f_cpu=4000000L
attinyx5.menu.clk.1int=1 MHz (internal)
attinyx5.menu.clk.1int.bootloader.low_fuses=0x62
attinyx5.menu.clk.1int.build.f_cpu=1000000L
attinyx5.menu.clk.737ext=7.372 MHz (external)
attinyx5.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx5.menu.clk.737ext.build.f_cpu=7372800L
attinyx5.menu.clk.92ext=9.216 MHz (external)
attinyx5.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.92ext.build.f_cpu=9216000L
attinyx5.menu.clk.11ext=11.0592 MHz (external)
attinyx5.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.11ext.build.f_cpu=11059200L
attinyx5.menu.clk.14ext=14.7456 MHz (external)
attinyx5.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.14ext.build.f_cpu=14745600L
attinyx5.menu.clk.184ext=18.432 MHz (external)
attinyx5.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx5.menu.clk.184ext.build.f_cpu=18432000L
attinyx5.menu.clk.128int=128 kHz (internal)
attinyx5.menu.clk.128int.bootloader.low_fuses=0xC4
attinyx5.menu.clk.128int.build.f_cpu=128000L
attinyx5.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx5.menu.ee.ayes=EEPROM retained
attinyx5.menu.ee.ayes.bootloader.eesave_bit=0
attinyx5.menu.ee.no=EEPROM not retained
attinyx5.menu.ee.no.bootloader.eesave_bit=1
attinyx5.menu.bod.disable=B.O.D. Disabled
attinyx5.menu.bod.disable.bootloader.bod_bits=111
attinyx5.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5.menu.bod.1v8.bootloader.bod_bits=110
attinyx5.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5.menu.bod.2v7.bootloader.bod_bits=101
attinyx5.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5.menu.bod.4v3.bootloader.bod_bits=100
attinyx5.build.variant=tinyX5

attinyx5opti.name=ATtiny45/85 (Optiboot)
attinyx5opti.upload.tool=avrdude
attinyx5opti.upload.protocol=arduino
attinyx5opti.upload.speed=19200
attinyx5opti.bootloader.tool=avrdude
attinyx5opti.bootloader.unlock_bits=0xFF
attinyx5opti.bootloader.lock_bits=0xFF
attinyx5opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx5opti.build.core=tiny
attinyx5opti.build.board=AVR_ATTINYX5
attinyx5opti.build.export_merged_output=false
attinyx5opti.bootloader.extended_fuses=0xFE
attinyx5opti.menu.LTO.no=Disabled
attinyx5opti.menu.LTO.no.ltocflags=
attinyx5opti.menu.LTO.no.ltoelfflags=
attinyx5opti.menu.LTO.no.ltocppflags=
attinyx5opti.menu.LTO.no.ltoarcmd=
attinyx5opti.menu.LTO.yes=Enabled
attinyx5opti.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx5opti.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx5opti.menu.LTO.yes.ltocppflags=-flto
attinyx5opti.menu.LTO.yes.ltoarcmd=gcc-
attinyx5opti.menu.T1CS.default=CPU
attinyx5opti.menu.T1CS.pll=64MHz
attinyx5opti.menu.T1CS.pll.build.extra_flags=-DPLLTIMER1
attinyx5opti.menu.T1CS.lowpll=32MHz
attinyx5opti.menu.T1CS.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx5opti.menu.chip.85=ATtiny85
attinyx5opti.menu.chip.85.build.mcu=attiny85
attinyx5opti.menu.chip.85.upload.maximum_size=7616
attinyx5opti.menu.chip.85.upload.maximum_data_size=512
attinyx5opti.menu.chip.45=ATtiny45
attinyx5opti.menu.chip.45.build.mcu=attiny45
attinyx5opti.menu.chip.45.upload.maximum_size=3520
attinyx5opti.menu.chip.45.upload.maximum_data_size=256
attinyx5opti.menu.clk.8int=8 MHz (internal)
attinyx5opti.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx5opti.menu.clk.8int.build.f_cpu=8000000L
attinyx5opti.menu.clk.16pll=16 MHz (PLL)
attinyx5opti.menu.clk.16pll.bootloader.low_fuses=0xF1
attinyx5opti.menu.clk.16pll.build.f_cpu=16000000L
attinyx5opti.menu.clk.20ext=20 MHz (external)
attinyx5opti.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.20ext.build.f_cpu=20000000L
attinyx5opti.menu.clk.16ext=16 MHz (external)
attinyx5opti.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.16ext.build.f_cpu=16000000L
attinyx5opti.menu.clk.12ext=12 MHz (external)
attinyx5opti.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.12ext.build.f_cpu=12000000L
attinyx5opti.menu.clk.8ext=8 MHz (external)
attinyx5opti.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.8ext.build.f_cpu=8000000L
attinyx5opti.menu.clk.737ext=7.372 MHz (external)
attinyx5opti.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx5opti.menu.clk.737ext.build.f_cpu=7372800L
attinyx5opti.menu.clk.92ext=9.216 MHz (external)
attinyx5opti.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.92ext.build.f_cpu=9216000L
attinyx5opti.menu.clk.11ext=11.0592 MHz (external)
attinyx5opti.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.11ext.build.f_cpu=11059200L
attinyx5opti.menu.clk.14ext=14.7456 MHz (external)
attinyx5opti.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.14ext.build.f_cpu=14745600L
attinyx5opti.menu.clk.184ext=18.432 MHz (external)
attinyx5opti.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx5opti.menu.clk.184ext.build.f_cpu=18432000L
attinyx5opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx5opti.menu.ee.ayes=EEPROM retained
attinyx5opti.menu.ee.ayes.bootloader.eesave_bit=0
attinyx5opti.menu.ee.no=EEPROM not retained
attinyx5opti.menu.ee.no.bootloader.eesave_bit=1
attinyx5opti.menu.bod.disable=B.O.D. Disabled
attinyx5opti.menu.bod.disable.bootloader.bod_bits=111
attinyx5opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx5opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx5opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx5opti.build.variant=tinyX5


