SpenceKonde/ATTinyCore/avr/boards.txt
attinyx8.name=ATtiny48/88
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0xFF
attinyx8.bootloader.lock_bits=0xFF
attinyx8.build.core=tiny
attinyx8.build.export_merged_output=false
attinyx8.menu.LTO.no=Disabled
attinyx8.menu.LTO.no.ltocflags=
attinyx8.menu.LTO.no.ltoelfflags=
attinyx8.menu.LTO.no.ltocppflags=
attinyx8.menu.LTO.no.ltoarcmd=
attinyx8.menu.LTO.yes=Enabled
attinyx8.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx8.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8.menu.LTO.yes.ltocppflags=-flto
attinyx8.menu.LTO.yes.ltoarcmd=gcc-
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0xff
attinyx8.menu.clk.8int=8 MHz (internal)
attinyx8.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx8.menu.clk.8int.build.f_cpu=8000000L
attinyx8.menu.clk.8int.bootloader.file=empty/empty_all.hex
attinyx8.menu.clk.1int=1 MHz (internal)
attinyx8.menu.clk.1int.bootloader.low_fuses=0x62
attinyx8.menu.clk.1int.build.f_cpu=1000000L
attinyx8.menu.clk.1int.bootloader.file=empty/empty_all.hex
attinyx8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8.menu.ee.ayes=EEPROM retained
attinyx8.menu.ee.ayes.bootloader.eesave_bit=0
attinyx8.menu.ee.no=EEPROM not retained
attinyx8.menu.ee.no.bootloader.eesave_bit=1
attinyx8.menu.bod.disable=B.O.D. Disabled
attinyx8.menu.bod.disable.bootloader.bod_bits=111
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.bod_bits=110
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.bod_bits=101
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.bod_bits=100
attinyx8.build.variant=tinyX8


attinyx8opti.name=ATtiny48/88 (optiboot)
attinyx8opti.upload.tool=avrdude
attinyx8opti.upload.protocol=arduino
attinyx8opti.upload.speed=19200
attinyx8opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx8opti.build.board=AVR_ATTINYX8
attinyx8opti.bootloader.tool=avrdude
attinyx8opti.bootloader.unlock_bits=0xFF
attinyx8opti.bootloader.lock_bits=0xFF
attinyx8opti.build.core=tiny
attinyx8opti.build.export_merged_output=false
attinyx8opti.menu.LTO.no=Disabled
attinyx8opti.menu.LTO.no.ltocflags=
attinyx8opti.menu.LTO.no.ltoelfflags=
attinyx8opti.menu.LTO.no.ltocppflags=
attinyx8opti.menu.LTO.no.ltoarcmd=
attinyx8opti.menu.LTO.yes=Enabled
attinyx8opti.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx8opti.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8opti.menu.LTO.yes.ltocppflags=-flto
attinyx8opti.menu.LTO.yes.ltoarcmd=gcc-
attinyx8opti.menu.chip.88=ATtiny88
attinyx8opti.menu.chip.88.build.mcu=attiny88
attinyx8opti.menu.chip.88.upload.maximum_size=7552
attinyx8opti.menu.chip.88.upload.maximum_data_size=512
attinyx8opti.menu.chip.48=ATtiny48
attinyx8opti.menu.chip.48.build.mcu=attiny48
attinyx8opti.menu.chip.48.upload.maximum_size=3456
attinyx8opti.menu.chip.48.upload.maximum_data_size=256
attinyx8opti.bootloader.extended_fuses=0xfe
attinyx8opti.menu.clk.8int=8 MHz (internal)
attinyx8opti.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx8opti.menu.clk.8int.build.f_cpu=8000000L
attinyx8opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8opti.menu.ee.ayes=EEPROM retained
attinyx8opti.menu.ee.ayes.bootloader.eesave_bit=0
attinyx8opti.menu.ee.no=EEPROM not retained
attinyx8opti.menu.ee.no.bootloader.eesave_bit=1
attinyx8opti.menu.bod.disable=B.O.D. Disabled
attinyx8opti.menu.bod.disable.bootloader.bod_bits=111
attinyx8opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx8opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx8opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx8opti.build.variant=tinyX8

attinyx7.name=ATtiny87/167 (No bootloader)
attinyx7.upload.maximum_data_size=512
attinyx7.upload.tool=avrdude
attinyx7.build.board=AVR_ATTINYX7
attinyx7.bootloader.tool=avrdude
attinyx7.bootloader.unlock_bits=0xFF
attinyx7.bootloader.lock_bits=0xFF
attinyx7.bootloader.file=empty/empty_all.hex
attinyx7.build.core=tiny
attinyx7.build.export_merged_output=false
attinyx7.bootloader.extended_fuses=0xFF
attinyx7.menu.LTO.no=Disabled
attinyx7.menu.LTO.no.ltocflags=
attinyx7.menu.LTO.no.ltoelfflags=
attinyx7.menu.LTO.no.ltocppflags=
attinyx7.menu.LTO.no.ltoarcmd=
attinyx7.menu.LTO.yes=Enabled
attinyx7.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx7.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7.menu.LTO.yes.ltocppflags=-flto
attinyx7.menu.LTO.yes.ltoarcmd=gcc-
attinyx7.menu.chip.167=ATtiny167
attinyx7.menu.chip.167.build.mcu=attiny167
attinyx7.menu.chip.167.upload.maximum_size=16384
attinyx7.menu.chip.87=ATtiny87
attinyx7.menu.chip.87.build.mcu=attiny87
attinyx7.menu.chip.87.upload.maximum_size=8196
attinyx7.upload.maximum_data_size=512
attinyx7.menu.clk.8int=8 MHz (internal)
attinyx7.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx7.menu.clk.8int.build.f_cpu=8000000L
attinyx7.menu.clk.20ext=20 MHz (external)
attinyx7.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.20ext.build.f_cpu=20000000L
attinyx7.menu.clk.16ext=16 MHz (external)
attinyx7.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.16ext.build.f_cpu=16000000L
attinyx7.menu.clk.12ext=12 MHz (external)
attinyx7.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.12ext.build.f_cpu=12000000L
attinyx7.menu.clk.8ext=8 MHz (external)
attinyx7.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.8ext.build.f_cpu=8000000L
attinyx7.menu.clk.6ext=6 MHz (external)
attinyx7.menu.clk.6ext.bootloader.low_fuses=0xFD
attinyx7.menu.clk.6ext.build.f_cpu=6000000L
attinyx7.menu.clk.4ext=4 MHz (external)
attinyx7.menu.clk.4ext.bootloader.low_fuses=0xFD
attinyx7.menu.clk.4ext.build.f_cpu=4000000L
attinyx7.menu.clk.1int=1 MHz (internal)
attinyx7.menu.clk.1int.bootloader.low_fuses=0x62
attinyx7.menu.clk.1int.build.f_cpu=1000000L
attinyx7.menu.clk.737ext=7.372 MHz (external)
attinyx7.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx7.menu.clk.737ext.build.f_cpu=7372800L
attinyx7.menu.clk.92ext=9.216 MHz (external)
attinyx7.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.92ext.build.f_cpu=9216000L
attinyx7.menu.clk.11ext=11.0592 MHz (external)
attinyx7.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.11ext.build.f_cpu=11059200L
attinyx7.menu.clk.14ext=14.7456 MHz (external)
attinyx7.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.14ext.build.f_cpu=14745600L
attinyx7.menu.clk.184ext=18.432 MHz (external)
attinyx7.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx7.menu.clk.184ext.build.f_cpu=18432000L
attinyx7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx7.menu.ee.ayes=EEPROM retained
attinyx7.menu.ee.ayes.bootloader.eesave_bit=0
attinyx7.menu.ee.no=EEPROM not retained
attinyx7.menu.ee.no.bootloader.eesave_bit=1
attinyx7.menu.bod.disable=B.O.D. Disabled
attinyx7.menu.bod.disable.bootloader.bod_bits=111
attinyx7.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7.menu.bod.1v8.bootloader.bod_bits=110
attinyx7.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7.menu.bod.2v7.bootloader.bod_bits=101
attinyx7.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7.menu.bod.4v3.bootloader.bod_bits=100
attinyx7.menu.pinmap.new=New style (down each side)
attinyx7.menu.pinmap.new.build.variant=tinyX7_New
attinyx7.menu.pinmap.old=Old style (SCL on 13)
attinyx7.menu.pinmap.old.build.variant=tinyX7


