SpenceKonde/ATTinyCore/avr/boards.txt
attinyx7opti.name=ATtiny167/87 (Optiboot)
attinyx7opti.upload.maximum_data_size=512
attinyx7opti.upload.protocol=arduino
attinyx7opti.upload.tool=avrdude
attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.unlock_bits=0xFF
attinyx7opti.bootloader.lock_bits=0xFF
attinyx7opti.build.core=tiny
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.menu.LTO.no=Disabled
attinyx7opti.menu.LTO.no.ltocflags=
attinyx7opti.menu.LTO.no.ltoelfflags=
attinyx7opti.menu.LTO.no.ltocppflags=
attinyx7opti.menu.LTO.no.ltoarcmd=
attinyx7opti.menu.LTO.yes=Enabled
attinyx7opti.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx7opti.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7opti.menu.LTO.yes.ltocppflags=-flto
attinyx7opti.menu.LTO.yes.ltoarcmd=gcc-
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.build.export_merged_output=false
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.build.export_merged_output=true
attinyx7opti.menu.chip.87.upload.maximum_size=7552
attinyx7opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx7opti.menu.clk.8int=8 MHz (internal)
attinyx7opti.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx7opti.menu.clk.8int.build.f_cpu=8000000L
attinyx7opti.menu.clk.8int.upload.speed=57600
attinyx7opti.menu.clk.16ext=16 MHz (external)
attinyx7opti.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.16ext.build.f_cpu=16000000L
attinyx7opti.menu.clk.16ext.upload.speed=115200
attinyx7opti.menu.clk.12ext=12 MHz (external)
attinyx7opti.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.12ext.build.f_cpu=12000000L
attinyx7opti.menu.clk.12ext.upload.speed=115200
attinyx7opti.menu.clk.8ext=8 MHz (external)
attinyx7opti.menu.clk.8ext.bootloader.low_fuses=0xFD
attinyx7opti.menu.clk.8ext.build.f_cpu=8000000L
attinyx7opti.menu.clk.8ext.upload.speed=57600
attinyx7opti.menu.clk.737ext=7.3728 MHz (external)
attinyx7opti.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx7opti.menu.clk.737ext.build.f_cpu=7372800L
attinyx7opti.menu.clk.737ext.upload.speed=57600
attinyx7opti.menu.clk.921external=9.216 MHz (external)
attinyx7opti.menu.clk.921external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.921external.build.f_cpu=9216000L
attinyx7opti.menu.clk.921external.upload.speed=57600
attinyx7opti.menu.clk.110external=11.0592 MHz (external)
attinyx7opti.menu.clk.110external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.110external.build.f_cpu=11059200L
attinyx7opti.menu.clk.110external.upload.speed=115200
attinyx7opti.menu.clk.147external=14.7456 MHz (external)
attinyx7opti.menu.clk.147external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.147external.build.f_cpu=14745600L
attinyx7opti.menu.clk.147external.upload.speed=115200
attinyx7opti.menu.clk.184ext=18.432 MHz (external - overclocked)
attinyx7opti.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx7opti.menu.clk.184ext.build.f_cpu=18432000L
attinyx7opti.menu.clk.184ext.upload.speed=115200
attinyx7opti.menu.bod.disable=B.O.D. Disabled
attinyx7opti.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7opti.menu.pinmap.new=New style (down each side)
attinyx7opti.menu.pinmap.new.build.variant=tinyX7_New
attinyx7opti.menu.pinmap.old=Old style (SCL on 13)
attinyx7opti.menu.pinmap.old.build.variant=tinyX7




attinyx61.name=ATtiny261/461/861
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0xFF
attinyx61.bootloader.lock_bits=0xFF
attinyx61.bootloader.file=empty/empty_all.hex
attinyx61.build.export_merged_output=false
attinyx61.build.core=tiny
attinyx61.menu.LTO.no=Disabled
attinyx61.menu.LTO.no.ltocflags=
attinyx61.menu.LTO.no.ltoelfflags=
attinyx61.menu.LTO.no.ltocppflags=
attinyx61.menu.LTO.no.ltoarcmd=
attinyx61.menu.LTO.yes=Enabled
attinyx61.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx61.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx61.menu.LTO.yes.ltocppflags=-flto
attinyx61.menu.LTO.yes.ltoarcmd=gcc-
attinyx61.menu.T1CS.default=CPU
attinyx61.menu.T1CS.pll=64MHz
attinyx61.menu.T1CS.pll.build.extra_flags=-DPLLTIMER1
attinyx61.menu.T1CS.lowpll=32MHz
attinyx61.menu.T1CS.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0xFF
attinyx61.menu.clk.8int=8 MHz (internal)
attinyx61.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx61.menu.clk.8int.build.f_cpu=8000000L
attinyx61.menu.clk.20ext=20 MHz (external)
attinyx61.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.20ext.build.f_cpu=20000000L
attinyx61.menu.clk.16ext=16 MHz (external)
attinyx61.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.16ext.build.f_cpu=16000000L
attinyx61.menu.clk.16pll=16 MHz (PLL)
attinyx61.menu.clk.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clk.16pll.build.f_cpu=16000000L
attinyx61.menu.clk.12ext=12 MHz (external)
attinyx61.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.12ext.build.f_cpu=12000000L
attinyx61.menu.clk.8ext=8 MHz (external)
attinyx61.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.8ext.build.f_cpu=8000000L
attinyx61.menu.clk.6ext=6 MHz (external)
attinyx61.menu.clk.6ext.bootloader.low_fuses=0xFD
attinyx61.menu.clk.6ext.build.f_cpu=6000000L
attinyx61.menu.clk.4ext=4 MHz (external)
attinyx61.menu.clk.4ext.bootloader.low_fuses=0xFD
attinyx61.menu.clk.4ext.build.f_cpu=4000000L
attinyx61.menu.clk.1int=1 MHz (internal)
attinyx61.menu.clk.1int.bootloader.low_fuses=0x62
attinyx61.menu.clk.1int.build.f_cpu=1000000L
attinyx61.menu.clk.737ext=7.372 MHz (external)
attinyx61.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx61.menu.clk.737ext.build.f_cpu=7372800L
attinyx61.menu.clk.92ext=9.216 MHz (external)
attinyx61.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.92ext.build.f_cpu=9216000L
attinyx61.menu.clk.11ext=11.0592 MHz (external)
attinyx61.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.11ext.build.f_cpu=11059200L
attinyx61.menu.clk.14ext=14.7456 MHz (external)
attinyx61.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.14ext.build.f_cpu=14745600L
attinyx61.menu.clk.184ext=18.432 MHz (external)
attinyx61.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx61.menu.clk.184ext.build.f_cpu=18432000L
attinyx61.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx61.menu.ee.ayes=EEPROM retained
attinyx61.menu.ee.ayes.bootloader.eesave_bit=0
attinyx61.menu.ee.no=EEPROM not retained
attinyx61.menu.ee.no.bootloader.eesave_bit=1
attinyx61.menu.bod.disable=B.O.D. Disabled
attinyx61.menu.bod.disable.bootloader.bod_bits=111
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.bod_bits=110
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.bod_bits=101
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.bod_bits=100
attinyx61.build.variant=tinyX61

attinyx61opti.name=ATtiny461/861 (optiboot)
attinyx61opti.upload.tool=avrdude
attinyx61opti.upload.protocol=arduino
attinyx61opti.upload.speed=19200
attinyx61opti.build.board=AVR_ATTINYX61
attinyx61opti.bootloader.tool=avrdude
attinyx61opti.bootloader.unlock_bits=0xFF
attinyx61opti.bootloader.lock_bits=0xFF
attinyx61opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx61opti.build.core=tiny
attinyx61opti.build.export_merged_output=false
attinyx61opti.menu.LTO.no=Disabled
attinyx61opti.menu.LTO.no.ltocflags=
attinyx61opti.menu.LTO.no.ltoelfflags=
attinyx61opti.menu.LTO.no.ltocppflags=
attinyx61opti.menu.LTO.no.ltoarcmd=
attinyx61opti.menu.LTO.yes=Enabled
attinyx61opti.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx61opti.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx61opti.menu.LTO.yes.ltocppflags=-flto
attinyx61opti.menu.LTO.yes.ltoarcmd=gcc-
attinyx61opti.menu.T1CS.default=CPU
attinyx61opti.menu.T1CS.pll=64MHz
attinyx61opti.menu.T1CS.pll.build.extra_flags=-DPLLTIMER1
attinyx61opti.menu.T1CS.lowpll=32MHz
attinyx61opti.menu.T1CS.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61opti.menu.chip.861=ATtiny861
attinyx61opti.menu.chip.861.build.mcu=attiny861
attinyx61opti.menu.chip.861.upload.maximum_size=7552
attinyx61opti.menu.chip.861.upload.maximum_data_size=512
attinyx61opti.menu.chip.461=ATtiny461
attinyx61opti.menu.chip.461.build.mcu=attiny461
attinyx61opti.menu.chip.461.upload.maximum_size=3456
attinyx61opti.menu.chip.461.upload.maximum_data_size=256
attinyx61opti.bootloader.extended_fuses=0xFE
attinyx61opti.menu.clk.8int=8 MHz (internal)
attinyx61opti.menu.clk.8int.bootloader.low_fuses=0xE2
attinyx61opti.menu.clk.8int.build.f_cpu=8000000L
attinyx61opti.menu.clk.20ext=20 MHz (external)
attinyx61opti.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.20ext.build.f_cpu=20000000L
attinyx61opti.menu.clk.16ext=16 MHz (external)
attinyx61opti.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.16ext.build.f_cpu=16000000L
attinyx61opti.menu.clk.16pll=16 MHz (PLL)
attinyx61opti.menu.clk.16pll.bootloader.low_fuses=0xF1
attinyx61opti.menu.clk.16pll.build.f_cpu=16000000L
attinyx61opti.menu.clk.12ext=12 MHz (external)
attinyx61opti.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.12ext.build.f_cpu=12000000L
attinyx61opti.menu.clk.8ext=8 MHz (external)
attinyx61opti.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.8ext.build.f_cpu=8000000L
attinyx61opti.menu.clk.737ext=7.372 MHz (external)
attinyx61opti.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx61opti.menu.clk.737ext.build.f_cpu=7372800L
attinyx61opti.menu.clk.92ext=9.216 MHz (external)
attinyx61opti.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.92ext.build.f_cpu=9216000L
attinyx61opti.menu.clk.11ext=11.0592 MHz (external)
attinyx61opti.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.11ext.build.f_cpu=11059200L
attinyx61opti.menu.clk.14ext=14.7456 MHz (external)
attinyx61opti.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.14ext.build.f_cpu=14745600L
attinyx61opti.menu.clk.184ext=18.432 MHz (external)
attinyx61opti.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx61opti.menu.clk.184ext.build.f_cpu=18432000L
attinyx61opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx61opti.menu.ee.ayes=EEPROM retained
attinyx61opti.menu.ee.ayes.bootloader.eesave_bit=0
attinyx61opti.menu.ee.no=EEPROM not retained
attinyx61opti.menu.ee.no.bootloader.eesave_bit=1
attinyx61opti.menu.bod.disable=B.O.D. Disabled
attinyx61opti.menu.bod.disable.bootloader.bod_bits=111
attinyx61opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx61opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx61opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx61opti.build.variant=tinyX61


