SpenceKonde/ATTinyCore/avr/boards.txt
attinyx313.name=ATtiny2313/4313
attinyx313.upload.maximum_size=4096
attinyx313.upload.maximum_data_size=256
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.bootloader.unlock_bits=0xFF
attinyx313.bootloader.lock_bits=0xFF
attinyx313.bootloader.file=empty/empty_all.hex
attinyx313.build.core=tiny
attinyx313.build.board=AVR_ATTINYX313
attinyx313.build.export_merged_output=false
attinyx313.bootloader.extended_fuses=0xFF
attinyx313.menu.LTO.no=Disabled
attinyx313.menu.LTO.no.ltocflags=
attinyx313.menu.LTO.no.ltoelfflags=
attinyx313.menu.LTO.no.ltocppflags=
attinyx313.menu.LTO.no.ltoarcmd=
attinyx313.menu.LTO.yes=Enabled
attinyx313.menu.LTO.yes.ltocflags=-flto -fno-fat-lto-objects
attinyx313.menu.LTO.yes.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx313.menu.LTO.yes.ltocppflags=-flto
attinyx313.menu.LTO.yes.ltoarcmd=gcc-
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313
attinyx313.menu.chip.2313.build.mcu=attiny2313
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128
attinyx313.menu.clk.8int=8 MHz (internal)
attinyx313.menu.clk.8int.bootloader.low_fuses=0xE4
attinyx313.menu.clk.8int.build.f_cpu=8000000L
attinyx313.menu.clk.20ext=20 MHz (external)
attinyx313.menu.clk.20ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.20ext.build.f_cpu=20000000L
attinyx313.menu.clk.16ext=16 MHz (external)
attinyx313.menu.clk.16ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.16ext.build.f_cpu=16000000L
attinyx313.menu.clk.12ext=12 MHz (external)
attinyx313.menu.clk.12ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.12ext.build.f_cpu=12000000L
attinyx313.menu.clk.8ext=8 MHz (external)
attinyx313.menu.clk.8ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.8ext.build.f_cpu=8000000L
attinyx313.menu.clk.1int=1 MHz (internal)
attinyx313.menu.clk.1int.bootloader.low_fuses=0x64
attinyx313.menu.clk.1int.build.f_cpu=1000000L
attinyx313.menu.clk.4internal=4 MHz (internal)
attinyx313.menu.clk.4internal.bootloader.low_fuses=0xE2
attinyx313.menu.clk.4internal.build.f_cpu=4000000L
attinyx313.menu.clk.6ext=6 MHz (external)
attinyx313.menu.clk.6ext.bootloader.low_fuses=0xFD
attinyx313.menu.clk.6ext.build.f_cpu=6000000L
attinyx313.menu.clk.4ext=4 MHz (external)
attinyx313.menu.clk.4ext.bootloader.low_fuses=0xFD
attinyx313.menu.clk.4ext.build.f_cpu=4000000L
attinyx313.menu.clk.5internal=0.5 MHz (internal)
attinyx313.menu.clk.5internal.bootloader.low_fuses=0x62
attinyx313.menu.clk.5internal.build.f_cpu=500000L
attinyx313.menu.clk.737ext=7.372 MHz (external)
attinyx313.menu.clk.737ext.bootloader.low_fuses=0xFD
attinyx313.menu.clk.737ext.build.f_cpu=7372800L
attinyx313.menu.clk.92ext=9.216 MHz (external)
attinyx313.menu.clk.92ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.92ext.build.f_cpu=9216000L
attinyx313.menu.clk.11ext=11.0592 MHz (external)
attinyx313.menu.clk.11ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.11ext.build.f_cpu=11059200L
attinyx313.menu.clk.14ext=14.7456 MHz (external)
attinyx313.menu.clk.14ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.14ext.build.f_cpu=14745600L
attinyx313.menu.clk.184ext=18.432 MHz (external)
attinyx313.menu.clk.184ext.bootloader.low_fuses=0xFF
attinyx313.menu.clk.184ext.build.f_cpu=18432000L
attinyx313.bootloader.high_fuses=0b{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx313.menu.ee.ayes=EEPROM retained
attinyx313.menu.ee.ayes.bootloader.eesave_bit=1001
attinyx313.menu.ee.no=EEPROM not retained
attinyx313.menu.ee.no.bootloader.eesave_bit=1101
attinyx313.menu.bod.disable=B.O.D. Disabled
attinyx313.menu.bod.disable.bootloader.bod_bits=1111
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.bod_bits=1101
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.bod_bits=1011
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.bod_bits=1001
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0=no
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1=yes
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1.build.extra_flags=-DINITIALIZE_SECONDARY_TIMERS=1
attinyx313.build.variant=tinyX313
